insert into users values 
	(1, 'Виктор', 'Иванов', '8852148525', 'dacxadlcedd@cdc', 'm', 'Рязань'),
	(2, 'Светлана', 'Сидорова', '2841518151', 'dsdcvcfrcdf@vbv', 'f', 'Омск'),
	(3, 'Гриша', 'Петров', '154651518', 'fvfsvnfrfds@vbv', 'm', 'Курск'),
	(4, 'Анна', 'Коротовских', '165846141', 'gdfvdgntyhhrt@vbv', 'f', 'Москва'),
	(5, 'Маргарита', 'Балуева', '2841518151', 'brtgdgbhyjy@vbv', 'f', 'Москва'),
	(6, 'Вячеслав', 'Воробьев', '2841518151', 'brbdbhnjy@vbv', 'm', 'Воронеж'),
	(7, 'Павел', 'Воробьев', '2543524843', 'zfjzdn.fnzd@vbv', 'm', 'Воронеж'),
	(8, 'Андрей', 'Воробьев', '7424572', 'sfkjdxkbgnxf@vbv', 'f', 'Воронеж'),
	(9, 'Петр', 'Смирнов', '7527854', 'skfehdzf@vbv', 'm', 'Омск'),
	(10, 'Татьяна', 'Смирнова', '257242', 'jfuhjdsbfjds@vbv', 'f', 'Курск');

insert into resume values 
	(2,'Продавец', 'gfrdccv gh gerwefrf', '25000', 'bkbjkghuv 7uhkjbkyku uhufgjj', '6', now()),
	(5, 'Юрист', 'bfadcvbger frwedfgr  verwfv', '45000','dscsdfsfsf', '7', now()),
	(1, 'Программист', 'dfsdcvfgerwed rwedvttr rgrew', '100000', 'mvksfmkvmfsv', '55', now()),
	(6, 'Врач', 'gbrevdc drtgtr gegfgf', '85000', 'fvgvfsvfsrvrkm', '56', now()),
	(3, 'Водитель', 'vrwrede wdefewf gfwfdfewdd efecefewdfrfr', '15000', '7uhkjbkyku uhufgjj', '25', now()),
	(4, 'Стоматолог', 'ghvhgvkhbv', '85000', 'nrwfbf ewpfienf', '11', now()),
	(7, 'Учитель', 'вмпвямчаивяав', '85000', 'впмяичапвя', '12', now()),
	(9, 'Повар', 'чмпямчива drtgtr gegfgf', '85000', 'вмявммчвсям', '13', now()),
	(8, 'Маляр', 'явмсиапк', '15000', 'вямсивсиимв', '14', now());

insert into company values 
	(2,'Газпром', '9', 'gfrdccv gh gerwefrf'),
	(5, 'Первый офис', '1', 'bfadcvbger frwedfgr  verwfv'),
	(1, 'Связной', '5', 'dfsdcvfgerwed rwedvttr rgrew'),
	(6, 'Лунная походка', '3', 'gbrevdc drtgtr gegfgf'),
	(3, 'Пуфик', '4', 'vrwrede wdefewf gfwfdfewdd efecefewdfrfr'),
	(7, 'Магнит', '3', 'аыааылммтотомт ама'),
	(8, 'Эльдорадо', '53', 'gbrevdc drtgtr gegfgf'),
	(9, 'Тотошка', '3', 'аымвыммвы фвсфвс'),
	(10, 'Овощи и фрукты', '3', 'выавлмтводс фвлст');

insert into vacancies values 
	(1,'Слесарь', 'Уметь слесарить трубы', 'Аккуратность', 'Рязань', '10000', now(), now()),
	(2,'Продавец', 'Продажи', 'Уметь продавать', 'Курск', '25000', now(), now()),
	(3,'Парикмахер', 'Уметь стричь', 'Коммуникабельность, диплом парикмахера', 'Рязань', '20000', now(), now()),
	(4,'Врач', 'Лечить', 'Вышсее образование', 'Москва', '100000', now(), now()),
	(5,'Контролер', 'Уметь слесарить трубы', 'Уметь считать', 'Рязань', '10000', now(), now()),
	(6,'Повар', 'Уметь слесарить трубы', 'Вкусно готовить', 'Рязань', '10000', now(), now()),
	(7,'Учитель', 'Учить детей', 'Аккуратность', 'Омск', '10000', now(), now());


insert into company_vacancies values 
	(1, 2),
	(5, 1),
	(4, 6),
	(6, 5),
	(8, 4),
	(10, 8),
	(7, 10);
	(1, 2);
